Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/justice/criminal_law/criminal_offences/drug_offences.html.txt.tmx
Source language: en
Languages: ga

source: The primary legislation under which criminal charges for drugs offences is brought is the Misuse of Drugs Act 1977 and the Misuse of Drugs Act, 1984
ga: Is iad an tAcht um Mí-Úsáid Drugaí 1977 agus an tAcht um Mí-Úsáid Drugaí 1984 an phríomhreachtaíocht faoina ndéantar cúisimh choiriúla mar gheall ar chionta drugaí a thionscnamh

source: These have been further amended by the Criminal Justice Act 1999, the Criminal Justice Act 2006 and the Criminal Justice Act 2007
ga: Leasaíodh na hAchtanna sin tuilleadh leis an Acht um Cheartas Coiriúil 1999, leis an Acht um Cheartas Coiriúil 2006 agus leis an Acht um Cheartas Coiriúil 2007

source: The Misuse of Drugs Regulations 1988 (SI 328 of 1988) (as amended) lists the various substances to which the legislation applies
ga: Tá liosta sna Rialacháin um Mí-Úsáid Drugaí 1988 (I.R. 328 de 1988) de na substaintí éagsúla lena mbaineann an reachtaíocht

source: The Criminal Justice (Psychoactive Substances) Act 2010 covers substances which are not specifically proscribed under the Misuse of Drugs Acts, but which have psychoactive effects
ga: Cuimsítear faoin Acht um Cheartas Coiriúil (Substaintí Sícighníomhacha), 2010 substaintí nach sainordaítear faoi na hAchtanna um Mí-Úsáid Drugaí, ach ag a bhfuil tionchar sícighníomhach

source: The main drug offences under which criminal charges are brought are offences of drug possession and possession for the purpose of supply
ga: Is iad na príomhchionta drugaí faoina ndéantar cúisimh choiriúla a thionscnamh cionta a bhaineann le seilbh drugaí agus seilbh chun críche soláthair

source: Role of the Garda Siochana in combating drug abuse and drug trafficking
ga: Ról an Gharda Síochana chun troid i gcoinne mhí-úsáid agus gháinneáil drugaí

source: The work of the Criminal Assets Bureau , established in 1996, has been very successful in seizing the assets of those convicted of drug trafficking
ga: D’éirigh thar cionn le Biúró na Sócmhainní Coiriúla, a bunaíodh i 1996, seilbh a ghabháil ar shócmhainní na ndaoine siúd a ciontaíodh as gáinneáil drugaí

source: The Garda Siochana has also established the National Drugs Unit to target national and international drugs trafficking
ga: Lena chois sin bhunaigh an Garda Síochána an tAonad Náisiúnta Drugaí le díriú ar gháinneáil náisiúnta agus idirnáisiúnta na ndrugaí

source: At local level, Local Drugs Units police the drugs situation and Garda juvenile liaison officers work with young people to try and prevent them getting involved with drugs
ga: Déanann na hAonaid Áitiúla Drugaí póilíneacht ar chúrsaí drugaí agus oibríonn oifigigh idirchaidreamh d’ógánaigh de chuid an Gharda le daoine óga chun iarracht a dhéanamh a mbaint le drugaí a chosc

source: In some Local Drugs Task Force areas, Community Policing Fora have been set up to deal with the drug problem with the help of the community
ga: Tá Fóraim um Póilíneacht Pobail bunaithe i roinnt ceantar de chuid Thascfhórsaí Áitiúla Drugaí le cabhair an phobail a fháil le dul i ngleic le fadhb na ndrugaí

source: In October 2008 Dial to Stop Drug Dealing was launched. This initiative tackled drug dealing in local communities by providing a confidential and completely anonymous way for someone to pass on information on drug dealing in their local community to the Gardaí
ga: Is tionscnamh Dial to Stop Drug Dealing chun ngleic mangaireacht drugaí i bpobail áitiúla trí bhealach rúnda agus go hiomlán gan ainm do dhuine a chur ar aghaidh maidir le faisnéis ar mangaireacht drugaí ina bpobal áitiúil do na Gardaí

source: The Gardai are also involved in a number of awareness-raising programmes such as the Garda Schools Programme and the Juvenile Diversion Programme
ga: Bíonn baint ag na Gardaí le roinnt clár spreagtha feasachta freisin ar nós Chlár Scoileanna na nGardaí agus an Clár Athstiúrtha na hÓige

source: Role of the Customs and Excise service in combating drug trafficking
ga: Ról na Seirbhíse Custam agus Máil sa troid i gcoinne na gáinneála drugaí

source: The Customs and Excise services are responsible for detecting and seizing controlled drugs at importation
ga: Tá freagracht ag na Seirbhísí Custam agus Máil as drugaí srianta a aimsiú agus a ghabháil ag a n-allmhairiú Oibríonn na Gardaí agus na Seirbhísí Custam agus Máil as lámha a chéile chun forghníomhú na ndlíthe drugaí

source: There is close co-operation between the Gardai and the Custom and Excise services in the area of drug law enforcement and a joint task force involving the Gardai, the Customs and Excise Services and the Naval Services has been set up
ga: Bunaíodh comh-thascfhórsa idir na Gardaí, na Seirbhísí Custam agus Máil agus an tSeirbhís Chabhlaigh, agus bíonn siad in idirchaidreamh le chéile go háitiúil le cosc a chur ar gháinneáil drugaí

source: These bodies liaise at a local level to prevent drug trafficking. The Customs and Excise services are involved in the Multi-Disciplinary Group on Organised Crime and are also very involved in the operation of the Criminal Assets Bureau with the Gardai
ga: Tá na Seirbhísí Custam agus Máil bainteach freisin leis an nGrúpa Il-disciplíneach um Choiriúlacht Eagraithe agus lena chois sin tugann siad féin agus na Gardaí gach cabhair d’oibriú Bhiúró na Sócmhainní Coiriúla

source: The Customs National Drug Team was set up by the Revenue Commissioners in 1992 to tackle the illegal importation of drugs into Ireland
ga: Bhunaigh na Coimisinéirí Ioncaim Foireann Náisiúnta Drugaí na gCustam i 1992 le dul i ngleic le hallmhairiú mídhleathach drugaí isteach go hÉirinn

source: Customs National Drug Team
ga: Foireann Náisiúnta Drugaí na gCustam

source: The Customs National Drug Team (CNDT) concentrates solely on combating the importation of illegal drugs into Ireland
ga: Díríonn Foireann Náisiúnta Drugaí na gCustam (FNDC) a haire go hiomlán ar an troid i gcoinne allmhairiú drugaí mídhleathacha isteach sa tír

source: The CNDT has its Head Office located in Dublin and intelligence units, operational units, maritime units and drug detector dog units that are strategically placed at all major ports and airports and at various coastal locations nation-wide
ga: Tá FNDC Ceannáras i mBaile Átha Cliath agus in aonaid fhaisnéise, feidhmiúcháin agus muirí agus aonaid na madraí braite drugaí atá lonnaithe go straitéiseach ag gach calafort agus aerfort mór agus ag ionaid éagsúla ar fud chósta na tíre

source: All CNDT units are mobile and can be deployed to other locations as necessary
ga: Tá gach aonad FNDC soghluaiste; féadfar iad a imlonnú chuig ionaid eile de réir mar is gá

source: The CNDT is supported by outfield officials who are also responsible for the detection and prevention of drug smuggling as part of their normal duties
ga: Tá oifigeach allamuigh eile ann chun tacú leis an FNDC leis an bhfreagracht acu as brath agus cosc smuigleáil drugaí mar chuid dá ngnáthdhualgais

source: Possession of controlled drugs - cannabis or cannabis resin
ga: Seilbh ar dhrugaí srianta - cannabas nó roisín cannabais

source: Under the Misuse of Drugs Acts anyone found in possession of cannabis or cannabis resin is guilty of an offence
ga: De réir na hAchtanna um Mí-Úsáid Drugaí, bíonn aon duine a fhaightear le cannabas nó roisín cannabais ina seilbh acu ciontach i gcion

source: If the court decides that the drug was for personal use and not for sale or distribution and this was a first offence, it can impose a class D fine on summary conviction in a District Court
ga: Má chinneann an chúirt gur le húsáid phearsanta agus nár lena ndíol nó lena ndáileadh a bhí an druga, agus gurbh é seo an chéad chion ag an duine sin, féadfaidh sí rang D fíneáil a ghearradh ar chiontú achomair sa Cúirt Dúiche

source: On conviction on indictment, the defendant can be fined €1,270
ga: Ar chiontú ar díotáil is féidir fíneáil €1,270 a ghearradh orthu

source: For a second offence, a class D fine may be imposed and on conviction on indictment, a fine of €2,540 can be imposed
ga: Don dara cion is féidir rang D fíneáil a ghearradh agus €2,540 d’fhíneáil ar chiontú ar díotáil

source: For a third or subsequent conviction, a class C fine can be imposed
ga: Don tríú nó do gach ciontú ina dhiaidh sin is féidir rang C fíneáil a ghearradh

source: If the court decides, a prison sentence of not more than 12 months can be imposed as well
ga: Más é cinneadh na cúirte é féadtar téarma príosúnachta 12 mí a ghearradh freisin

source: On conviction on indictment, the court may decide on an appropriate fine and/or a prison sentence of up to three years can be imposed
ga: Ar chiontú ar díotáil, féadann an chúirt fíneáil iomchuí a shocrú agus/nó is féidir pianbhreith suas le trí bliana a ghearradh

source: Possession of any other controlled drugs
ga: Seilbh ar aon drugaí srianta eile

source: It is an offence to be in possession of a controlled drug and on summary conviction for this offence, you could be liable for a class C fine or a prison sentence of no longer than 12 months
ga: Is cion é druga srianta a bheith i seilbh duine agus ar chiontú achomhair don chion seo, d’fhéadfá a bheith faoi dhliteanas as rang C fíneáil nó pianbhreith príosúnachta nach faide ná 12 mí é

source: If the court decides, you could be liable for both
ga: Féadann an chúirt a chinneadh go gcaithfeá an dá phionós a íoc

source: On conviction on indictment for possessing controlled drugs, the court can decide on an appropriate fine and you could also be liable for a prison sentence of not more than 7 years
ga: Ar chiontú ar díotáil i seilbh drugaí srianta, is féidir leis an chúirt fíneáil iomchuí a shocrú agus d’fheadfá a bheith faoi dhliteanas as tréimhse príosúnachta nach mó ná 7 mbliana

source: Again, if the court decides, you could be liable for both
ga: Agus arís, d’fhéadfadh an chúirt an dá phionós a ghearradh ort

source: Growing cannabis plants or opium poppies
ga: Plandaí cannabais nó codlaidín a fhás

source: It is also an offence to grow cannabis plants or opium poppies and on summary conviction for this offence, you could be liable for a class C fine or a prison sentence of no longer than 12 months. If the court decides, you could be liable for both
ga: Is cion freisin é plandaí cannabais nó codlaidín a fhás agus d’fhéadfaí rang C fíneáil nó tréimhse príosúnachta nach mó ná 12 mí a ghearradh ort ar do chiontú achomair, agus d’fhéadfadh an chúirt a chinneadh an dá phionós a ghearradh ort

source: On conviction on indictment for growing these plants, the court can decide on an appropriate fine and you could also be liable for a prison sentence of not more than 14 years
ga: Ar do chiontú ar díotáil as na plandaí sin a fhás, féadann an chúirt fíneáil iomchuí a shocrú agus d’fhéadfá a bheith faoi dhliteanas príosúnacht nach mó ná 14 bliain

source: It is an offence to use prepared opium (e.g., heroin) for illegal use, to go to a place for the purposes of using opium or to have any paraphernalia (pipes, utensils) associated with illegal opium use in your possession
ga: Is cion é úsáid mhídhleathach a bhaint as codlaidín ullmhaithe (m.sh. hearóin), dul go hionad chun críoch codlaidín a úsáid nó ceann ar bith de na giuirléidí sin (píopaí, uirlisí) a bhaineann le mí-úsáid codlaidín a bheith i do sheilbh agat

source: On summary conviction for this offence, you could be liable for a class C fine or a prison sentence of no longer than 12 months
ga: Is féidir rang C fíneáil a ghearradh ort ar chiontú go hachomair tú don chion seo, nó d’fhéadfaí tú a chur go príosún ar feadh tréimhse nach mó ná 12 mí

source: On conviction on indictment for this offence, the court can decide on an appropriate fine and you could also be liable for a prison sentence of no more than 14 years
ga: Ar chiontú ar díotáil don chion seo, d’fhéadfadh an chúirt méid na fíneála a shocrú agus d’fhéadfá a bheith faoi dhliteanas do thréimhse nach mó ná 14 bliain phríosúnachta

source: Possession of controlled drugs for sale or supply
ga: Seilbh drugaí rialaithe lena ndíol nó lena soláthar

source: Under the legislation, it is an offence to be in possession of a controlled drug with the intention of selling it illegally
ga: Faoin reachtaíocht, is cion é a bheith i seilbh druga rialaithe agus é ar intinn é a dhíol go mídhleathach

source: Anyone found guilty of this offence is liable to a class C fine on summary conviction in a District Court
ga: Is féidir rang C fíneáil a ghearradh ar aon duine a gheofar ciontach sa chion sin ar é nó í a chiontú go hachomair i gCúirt Dúiche

source: If the court decides, he or she could be subject to a fine and a prison term not exceeding 12 months
ga: Má chinneann an chúirt amhlaidh, d’fhéadfaí fíneáil agus téarma príosúnachta nach faide ná 12 mhí a chur air nó uirthi

source: On conviction on indictment for this offence, the court can decide on an appropriate fine
ga: Ar dhuine a chiontú ar díotáil sa chion sin, is féidir leis an gcúirt cinneadh a dhéanamh i dtaobh fíneála cuí

source: The court can also impose a life sentence for this offence if it decides it is necessary
ga: Is féidir leis an gcúirt freisin pianbhreith saoil a fhorchur mar gheall ar an gcion sin má chinneann sí gur gá é

source: However, lesser sentences can also be imposed, either with a fine or alone
ga: Is féidir pianbhreitheanna níos giorra ná sin a fhorchur freisin áfach, i dteannta fíneála nó leo féin

source: Where the market value of the drugs is €13,000 or more, the person convicted is liable for a minimum sentence of 10 years
ga: I gcás gur €13,000 nó níos mó margadhluach na ndrugaí, dlítear pianbhreith íosta 10 mbliana a chur ar an duine a chiontaítear

source: This does not apply, however, where the court is satisfied there are exceptional circumstances
ga: Níl feidhm ag an méid sin áfach i gcás inar deimhin leis an gcúirt go bhfuil imthosca eisceachtúla i gceist

source: Similar penalties apply to somone convicted of importing drugs with a value of €13,000 or more
ga: Tá pionóis den tsamhail chéanna infheidhme maidir le duine a chiontaítear in allmhairiú drugaí a bhfuil luach €13,000 nó níos mó leo

source: Anyone found guilty of supplying or attempting to supply a controlled drug into a prison, children detention school or remand centre can receive a class B fine on summary conviction or a prison term not exceeding 12 months or both
ga: Is féidir rang B fíneáil nó téarma príosúnachta nach faide ná 12 mhí, nó iad araon, a chur ar aon duine a gheofar ciontach i ndruga rialaithe a sholáthar nó in iarracht a dhéanamh druga rialaithe a sholáthar i bpríosún nó i scoil choinneála leanaí nó in ionad coinneála ar é nó í a chiontú go hachomair

source: On conviction on indictment, the court can impose an appropriate fine or a maximum prison term of 10 years or both
ga: Ar dhuine a chiontú ar díotáil, is féidir leis an gcúirt fíneáil chuí nó téarma príosúnachta uasta 10 mbliana, nó iad araon, a chur air nó uirthi

source: Under the Criminal Justice (Psychoactive Substances) Act 2010 it is an offence to sell or supply for human consumption substances which are not specifically proscribed under the Misuse of Drugs Acts, but which have psychoactive effects
ga: Faoin Acht um Cheartas Coiriúil (Substaintí Sícighníomhacha), 2010, cion é substaintí a dhíol nó a sholáthar do thomhaltas ag daoine nach sainordaítear faoi na hAchtanna um Mí-Úsáid Drugaí, ach ag a bhfuil tionchar sícighníomhach

source: Anyone found guilty of such an offence is liable for a class A fine on summary conviction or imprisoned for a term not exceeding 12 months or both
ga: Beidh aon duine a chiontaítear i leith na ciona sin faoi dhliteanas fíneáil aicme A a íoc ar ciontú acomhair nó tréimhse a chaitheamh sa phríosún le haghaidh téarma nach faide ná 12 mhí nó an dá rud

source: On conviction on indictment they can be fined or imprisoned for a term not exceeding 5 years or both
ga: Ar ciontú ar comhdhíotáil, is féidir fíneáil a ghearradh ar an duine sin nó iad a chur sa phríosún le haghaidh téarma nach faide ná 5 bliana nó an dá rud

source: Use of premises, vehicles or vessels for certain activities
ga: Áitreabh, feithiclí nó soithí a úsáid le haghaidh gníomhaíochtaí áirithe

source: Anyone who occupies or controls any land, vehicle or vessel and is found guilty of allowing it to be used for activities such as the manufacture, importation or supply of a controlled drug is liable on summary conviction to a class C fine or a prison sentence of no longer than 12 months or both
ga: Aon duine a bhfuil aon talamh, feithicil nó soitheach ar áitiú nó faoina rialú aige nó aici agus a gheofar ciontach i gceadú an talamh, an fheithicil nó an soitheach sin a úsáid le haghaidh gníomhaíochtaí ar nós druga rialaithe a mhonarú, a allmhairiú nó a sholáthar, dlífear, ar é nó í a chiontú go hachomair, rang C fíneáil nó pianbhreith phríosúnachta nach faide ná 12 mhí, nó iad araon, a chur air nó uirthi

source: On conviction on indictment for this offence, the court can impose an appropriate fine or a prison sentence of no more than 14 years or both
ga: Ar dhuine a chiontú ar díotáil sa chion sin, is féidir leis an gcúirt fíneáil chuí nó pianbhreith phríosúnachta nach faide ná 14 bliana, nó iad araon, a chur air nó uirthi

source: Forged or fraudulently altered prescriptions
ga: Oidis a bhrionnaítear nó oidis a athraítear go calaoiseach

source: It is an offence to forge a prescription or to try to change it in any way in order to deceive
ga: Is cion é oideas a bhrionnú nó athrú ar bith a dhéanamh air chun dallamullóg a chur ar dhuine

source: Anyone found guilty of this offence is liable, on summary conviction, to a class D fine or a prison sentence not exceeding 6 months
ga: Is féidir rang D fíneáil nó tréimhse phríosúnachta nach mó ná 6 mhí a ghearradh ar dhuine ar chiontú go hachomair iad

source: On conviction on indictment for this offence, the court can decide on an appropriate fine and/or impose a prison term not exceeding 3 years
ga: Ar chiontú ar díotáil don chion seo d’fhéadfadh an chúirt méid chuí a shocrú don fhíneáil agus/nó tréimhse phríosúnachta nach mó ná 3 bliana a ghearradh orthu

source: Attempting or helping others to commit an offence
ga: Iarracht cion a dhéanamh nó cuidiú le daoine eile cion a dhéanamh

source: It is an offence to attempt to commit a drug offence covered by the legislation, or to help or incite someone else to commit the drug offence
ga: Is cion é iarracht a dhéanamh cion drugaí a thagann faoi réim na reachtaíochta a dhéanamh nó cuidiú le duine éigin eile, nó a thabhairt ar dhuine éigin eile, an cion drugaí a dhéanamh

source: If you are found guilty you are liable to be sentenced as if you had committed the drug offence
ga: Má fhaightear ciontach tú dlífear pianbhreith a chur ort amhail is go ndearna tú an cion drugaí

source: For some drugs offences, (illegal possession of controlled drugs, possession of controlled drugs for unlawful sale or supply, breaking the regulations regarding opium, growing opium poppies or cannabis plants or forging or fraudulently altering prescriptions), the court may decide that imposing the usual penalties is not the most effective response
ga: Maidir le roinnt cionta drugaí (drugaí srianta i seilbh duine, drugaí srianta i seilbh duine lena ndíol nó lena soláthar go mídhleathach, briseadh na rialachán maidir le codlaidín, codlaidín nó cannabas a fhás, nó oidis a bhrionnú nó a athrú go calaoiseach), d’fheadfadh an chúirt a chinneadh nárbh iad na gnáthphionóis an freagra ab fhearr

source: The court can remand you for whatever period it considers necessary (no longer than eight days if you are being held in custody)
ga: Féadfaidh an chúirt tú a chur siar faoi choinneáil ar feadh cibé tréimhse a mheasann sí is gá (ach gan dul thar ocht lá má bhíonn tú faoi choinneáil)

source: During this time, the court can ask the Health Service Executice (HSE), a probation officer or other qualified person to prepare a medical report and/or a report on your vocational, educational and social circumstances
ga: I rith an ama sin, féadfaidh an chúirt a iarraidh ar Feidhmeannacht na Seirbhise Sláinte (FSS), ar oifigeach promhaidh nó ar dhuine incháilithe eile tuairisc sláinte a ullmhú nó/agus tuairisc faoi do chúinsí gairmiúla oideachasúla agus sóisialta

source: They may also be asked to make recommendations for your treatment
ga: Féadfaidh sí a iarraidh orthu moltaí a dhéanamh faoi do chóireáilse

source: Based on the findings of these reports, the court may decide not to impose a fine or prison sentence on you
ga: Ar bhunús na dtuairiscí sin, d’fhéadfadh an chúirt a chinneadh gan fíneáil ná príosúnacht a ghearradh ort, ach tú a chur faoi mhaoirsiú duine nó comhlachta ainmnithe (cosúil le Bord Sláinte) ar feadh tréimhse shonraithe áirithe

source: Instead, you may be placed under the supervision of a named person or body (such as the HSE) for a specified period of time or you may be required to get the kind of treatment (medical or otherwise) that has been recommended for you
ga: Nó d’fhéadfá a bheith faoi iallach an chóireáil a moladh duitse a fháil (FSS nó eile)

source: The court may also order that you complete a course of education, instruction or training that will improve your job prospects or social circumstances, facilitate your social rehabilitation or reduce the likelihood of you committing further drugs offences
ga: D’fhéadfadh an chúirt a ordú duit freisin cúrsa oideachais, teagaisc nó oiliúna a chomhlánú a fheabhsóidh d’ionchais fhostaíochta nó do chúinsí sóisialta, a éascóidh d'athshlánú sóisialta nó a laghdóidh an dóchúlacht go ndéanfaidh tú tuilleadh coireanna drugaí

source: Depending on the circumstances of your case, the court may order that you be detained in a specialised custodial treatment centre
ga: Ag brath ar chúinsí do cháis, d’fhéadfadh an chúirt ordú a thabhairt go gcuirfí faoi choinneáil tú go hionad saincheaptha um chóireáil choinneála

source: The period you can be held for depends on your offence
ga: Bhraithfidh fad na tréimhse a choinneofaí ann tú ar do chion

source: You cannot be held for longer than a year, but if the maximum period of imprisonment that the court may impose for your particular crime is shorter than a year, you can only be held for that period of time
ga: Ní féidir tú a choinneáil níos faide ná bliain amháin, ach más rud é gur lú ná bliain an tréimhse phríosúnachta is faide a d’fhéadfaí a ghearradh ort do do choirse, ní féidir tú a choinneáil ach don tréimhse sin

source: If the court decides it is in your best interests, you may not be allowed to see the contents of any report that has been prepared on your case
ga: Má mheasann an chúirt gurbh chun do leasa é, b’fhéidir nach gceadófaí duit inneachar aon tuairisce a ullmhaíodh faoi do chás a fheiceáil

source: However, the report will be made available to your barrister or solicitor
ga: Cuirfear an tuairisc ar fáil do d’abhcóide nó do d’aturnae

source: If you ignore an order of the court, you can be detained in a custodial treatment centre or have the usual penalties for your offence (fines and/or imprisonment) imposed on you
ga: Má dhéanann tú neamhaird d’ordú na cúirte, is féidir tú a choinneáil in ionad um chóireáil choinneála nó na gnáthphionóis do do chionsa (fíneálacha nó/agus príosúnacht) a ghearradh ort

source: If you have been sent to a custodial treatment centre by a court order, you can make an application to the court that detention is no longer in your best interest or in the best interests of other people at the centre
ga: Má seoladh go hionad um chóireáil choinneála ar ordú cúirte tú, féadfaidh tú iarratas a chur faoi bhráid na cúirte nach chun do leasa é an choinneáil a thuilleadh, nó chun leasa daoine eile san ionad
